// Зробіть функцію, яка приймає параметром число від 1 до 7, а повертає день тижня українською мовою
// Даний рядок типу 'var_text_hello'. Зробіть із нього текст 'VarTextHello'.
// Створіть функцію, яка заповнюватиме масив 10-ма іксами за допомогою циклу.
// Створіть маасив на 50 елементів та заповніть кожен елемент його номером, виведіть кожен непарний елемент у параграфі, а парний у діві.
// Якщо змінна a більше нуля - то в ggg запишемо функцію, яка виводить один!, інакше запишемо функцію, яка виводить два!
// Використовуючи CallBack function створіть калькулятор, який буде від користувача приймати 2 числа і знак арефметичної операції. При введенні не числа або при розподілі на 0 виводити помилку.
// Функція ggg приймає 2 параметри: анонімну функцію, яка повертає 3 та анонімну функцію, яка повертає 4. Поверніть результатом функції ggg суму 3 та 4.
// Зробіть функцію, яка рахує та виводить кількість своїх викликів.